*** src/hook_run/mod.rs:102:5: replace bundle_recall_queries -> anyhow::Result<Vec<BundleRecallQuery>> with Ok(vec![])

*** mutation diff:
--- src/hook_run/mod.rs
+++ replace bundle_recall_queries -> anyhow::Result<Vec<BundleRecallQuery>> with Ok(vec![])
@@ -94,42 +94,17 @@
 /// Build the cross-project bundle recall queries for a set of active bundles.
 /// One query per bundle, in input order. Bundle names are validated first; an
 /// invalid name aborts the whole set so a malformed bundle can't inject recall
 /// metacharacters.
 ///
 /// # Errors
 /// Returns an error if any bundle name fails [`validate_bundle`].
 pub fn bundle_recall_queries(bundles: &[String]) -> anyhow::Result<Vec<BundleRecallQuery>> {
-    if bundles.is_empty() {
-        debug!("no bundles configured for recall");
-        return Ok(Vec::new());
-    }
-    debug!(
-        bundle_count = bundles.len(),
-        "building bundle recall queries"
-    );
-    bundles
-        .iter()
-        .map(|bundle| {
-            validate_bundle(bundle).map_err(|e| {
-                warn!(
-                    bundle = %bundle,
-                    error = %e,
-                    "bundle name validation failed"
-                );
-                e
-            })?;
-            debug!(bundle = %bundle, "bundle recall query created");
-            Ok(BundleRecallQuery {
-                bundle: bundle.clone(),
-                keyword: action::bundle_keyword(bundle),
-            })
-        })
-        .collect()
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Per-call network timeout. Lifecycle hooks run on startup and every prompt, so
 /// a slow/dead remote ICM must not stall the agent. 2s balances real round-trips
 /// against not hanging the prompt.
 const HOOK_TIMEOUT: Duration = Duration::from_secs(2);
 
 /// An engine-neutral lifecycle event. Adapters translate these to native hook

---- hook_run::tests::dispatch_tag_and_bundle_with_same_name_produce_distinct_recalls stdout ----

thread 'hook_run::tests::dispatch_tag_and_bundle_with_same_name_produce_distinct_recalls' (22569699) panicked at src/hook_run/mod.rs:3920:9:
assertion `left == right` failed
  left: 2
 right: 3

---- hook_run::tests::bundle_recall_queries_validates_bundle_names stdout ----

thread 'hook_run::tests::bundle_recall_queries_validates_bundle_names' (22569656) panicked at src/hook_run/mod.rs:3933:9:
assertion failed: bundle_recall_queries(&["".to_string()]).is_err()

---- hook_run::tests::prop_dispatch_turn_start_ordering stdout ----
proptest: Saving this and future failures in /Users/ranger/.cache/llmenv/claude-code/3/65470f3c02b7/tmp/cargo-mutants-llmenv-WWh1Qy.tmp/proptest-regressions/hook_run/mod.txt
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file. (You may need to create it.)
cc df316e56bace51ed4d3e281dd42dbd3d0da5f0bdb86e7f90ff6cda94bd698ac1

thread 'hook_run::tests::prop_dispatch_turn_start_ordering' (22569982) panicked at src/hook_run/mod.rs:4024:5:
Test failed: assertion failed: `(left == right)` 
  left: `1`,
 right: `2` at src/hook_run/mod.rs:4036.
minimal failing input: tags = [], bundles = [
    "A",
]
	successes: 1
	local rejects: 0

failures:
    hook_run::tests::bundle_recall_queries_validates_bundle_names
    hook_run::tests::dispatch_tag_and_bundle_with_same_name_produce_distinct_recalls
    hook_run::tests::prop_dispatch_turn_start_ordering
    hook_run::tests::turn_start_expands_one_recall_bundle_per_active_bundle
    hook_run::tests::turn_start_interleaves_tag_and_bundle_recalls

test result: FAILED. 1871 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 245.74s

*** result: Failure(101)
