*** src/hook_run/mod.rs:198:9: replace <impl std::fmt::Display for HookEvent>::fmt -> std::fmt::Result with Ok(Default::default())

*** mutation diff:
--- src/hook_run/mod.rs
+++ replace <impl std::fmt::Display for HookEvent>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -190,30 +190,17 @@
                  subagent_stop|pre_compact)"
             )),
         }
     }
 }
 
 impl std::fmt::Display for HookEvent {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        let s = match self {
-            HookEvent::SessionStart => "session_start",
-            HookEvent::TurnStart => "turn_start",
-            HookEvent::SessionEnd => "session_end",
-            HookEvent::UserPromptSubmit => "user_prompt_submit",
-            HookEvent::PreToolUse => "pre_tool_use",
-            HookEvent::PostToolUse => "post_tool_use",
-            HookEvent::Notification => "notification",
-            HookEvent::Stop => "stop",
-            HookEvent::SubagentStop => "subagent_stop",
-            HookEvent::PreCompact => "pre_compact",
-            HookEvent::PostSession => "post_session",
-        };
-        f.write_str(s)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// The ordered actions to run for an event, given the active tags' and bundles'
 /// recall queries (built by [`tag_recall_queries`] and [`bundle_recall_queries`],
 /// the single sources of tag→recall and bundle→recall expansion), plus the
 /// active memory entry's configured wake-up token budget (#1216, `None` if
 /// unset), threaded straight into `Action::WakeUp` on `SessionStart`.

*** result: Success
