*** src/hook_run/mod.rs:255:5: replace event_to_log_kind -> Option<(EventKind, &'static str)> with None

*** mutation diff:
--- src/hook_run/mod.rs
+++ replace event_to_log_kind -> Option<(EventKind, &'static str)> with None
@@ -247,26 +247,17 @@
         HookEvent::PostSession => vec![], // consolidation runs as a separate step
     }
 }
 
 /// Maps a `HookEvent` to its session-log `(kind, role)`. `None` for
 /// the lifecycle/memory events (`SessionStart`/`TurnStart`/`SessionEnd`),
 /// which `handle_session_log` handles separately.
 fn event_to_log_kind(event: HookEvent) -> Option<(EventKind, &'static str)> {
-    match event {
-        HookEvent::UserPromptSubmit => Some((EventKind::Prompt, "user")),
-        HookEvent::PreToolUse => Some((EventKind::ToolUse, "tool")),
-        HookEvent::PostToolUse => Some((EventKind::ToolResult, "tool")),
-        HookEvent::Notification => Some((EventKind::Notification, "system")),
-        HookEvent::Stop | HookEvent::SubagentStop => Some((EventKind::Stop, "assistant")),
-        HookEvent::PreCompact => Some((EventKind::Notification, "system")),
-        HookEvent::SessionStart | HookEvent::TurnStart | HookEvent::SessionEnd => None,
-        HookEvent::PostSession => None, // consolidation runs as a separate step
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Extract `(tool_name, content)` for a hook event from Claude's hook stdin
 /// payload. Field names per the Claude Code hooks reference: prompt text on
 /// `UserPromptSubmit` is `prompt`; tool calls carry `tool_name` +
 /// `tool_input` (`PreToolUse`) or `tool_input` + `tool_response`
 /// (`PostToolUse`); `Notification` carries `message`; `Stop`/`SubagentStop`
 /// carry `last_assistant_message`; `PreCompact` carries `trigger`.

*** result: Success
