*** src/hook_run/mod.rs:61:5: replace tag_recall_queries -> anyhow::Result<Vec<TagRecallQuery>> with Ok(vec![])

*** mutation diff:
--- src/hook_run/mod.rs
+++ replace tag_recall_queries -> anyhow::Result<Vec<TagRecallQuery>> with Ok(vec![])
@@ -53,34 +53,17 @@
 
 /// Build the cross-project tag recall queries for a set of active tags.
 /// One query per tag, in input order. Tags are validated first; an invalid tag
 /// aborts the whole set so a malformed scope can't inject recall metacharacters.
 ///
 /// # Errors
 /// Returns an error if any tag fails [`validate_tag`].
 pub fn tag_recall_queries(tags: &[String]) -> anyhow::Result<Vec<TagRecallQuery>> {
-    if tags.is_empty() {
-        debug!("no tags configured for recall");
-        return Ok(Vec::new());
-    }
-    debug!(tag_count = tags.len(), "building tag recall queries");
-    tags.iter()
-        .map(|tag| {
-            validate_tag(tag).map_err(|e| {
-                warn!(tag = %tag, error = %e, "tag name validation failed");
-                e
-            })?;
-            debug!(tag = %tag, "tag recall query created");
-            Ok(TagRecallQuery {
-                tag: tag.clone(),
-                keyword: action::tag_keyword(tag),
-            })
-        })
-        .collect()
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// A single cross-project, bundle-scoped recall the TurnStart hook issues
 /// against ICM. Mirrors [`TagRecallQuery`] for bundles (#228): each query is
 /// **project-unfiltered** (`project: ""`) and keyed on
 /// `llmenv-bundle:<bundle>`, so memory stored under that bundle in any project
 /// surfaces when the bundle activates here.
 #[derive(Debug, Clone, PartialEq, Eq)]

---- hook_run::tests::dispatch_tag_and_bundle_with_same_name_produce_distinct_recalls stdout ----

thread 'hook_run::tests::dispatch_tag_and_bundle_with_same_name_produce_distinct_recalls' (22502545) panicked at src/hook_run/mod.rs:3928:9:
assertion `left == right` failed
  left: 2
 right: 3

---- hook_run::tests::prop_dispatch_turn_start_ordering stdout ----
proptest: Saving this and future failures in /Users/ranger/.cache/llmenv/claude-code/3/65470f3c02b7/tmp/cargo-mutants-llmenv-pfCZRH.tmp/proptest-regressions/hook_run/mod.txt
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file. (You may need to create it.)
cc 89236d98ee96187bf6f894723a033877d7c99047f868896c55dbc6e0bcbd2095

thread 'hook_run::tests::prop_dispatch_turn_start_ordering' (22502793) panicked at src/hook_run/mod.rs:4032:5:
Test failed: assertion failed: `(left == right)` 
  left: `1`,
 right: `2` at src/hook_run/mod.rs:4044.
minimal failing input: tags = [
    "A",
], bundles = []
	successes: 0
	local rejects: 0

---- hook_run::tests::turn_start_expands_one_recall_tag_per_active_tag stdout ----

thread 'hook_run::tests::turn_start_expands_one_recall_tag_per_active_tag' (22503295) panicked at src/hook_run/mod.rs:3836:9:
assertion `left == right` failed: TurnStart must run project recall then one tag recall per active tag
  left: [Recall]
 right: [Recall, RecallTag(TagRecallQuery { tag: "rust", keyword: "llmenv-tag:rust" }), RecallTag(TagRecallQuery { tag: "work-vpn", keyword: "llmenv-tag:work-vpn" })]

failures:
    hook_run::tests::dispatch_tag_and_bundle_with_same_name_produce_distinct_recalls
    hook_run::tests::prop_dispatch_turn_start_ordering
    hook_run::tests::turn_start_expands_one_recall_tag_per_active_tag
    hook_run::tests::turn_start_interleaves_tag_and_bundle_recalls

test result: FAILED. 1872 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 109.26s

*** result: Failure(101)
