*** src/merge/rules.rs:101:12: delete ! in walk

*** mutation diff:
--- src/merge/rules.rs
+++ delete ! in walk
@@ -93,17 +93,17 @@
         let p = entry.path();
         if file_type.is_symlink() {
             continue;
         }
         if file_type.is_dir() {
             walk(bundle_root, &p, bundle_name, out)?;
             continue;
         }
-        if !file_type.is_file() {
+        if  /* ~ changed by cargo-mutants ~ */file_type.is_file() {
             continue;
         }
         if p.extension().is_none_or(|e| e != "md") {
             continue;
         }
         let raw = std::fs::read_to_string(&p)?;
         let (frontmatter, body) = split_frontmatter(&raw);
         let rel = p

---- merge::rules::tests::collect_finds_and_parses_md_files stdout ----

thread 'merge::rules::tests::collect_finds_and_parses_md_files' (22742430) panicked at src/merge/rules.rs:206:9:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    merge::rules::tests::collect_finds_and_parses_md_files

test result: FAILED. 1875 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 107.12s

*** result: Failure(101)
